adtbch/robot_manual/esp32controllerV2/sdkconfig.defaults
#
# sdkconfig.defaults — Reproducible default config untuk esp32controllerV2
# Hybrid: Arduino framework dengan native ESP-IDF API
#
# Board   : ESP32 Dev Module
# Target  : ESP32 (bukan S3/C3/C6)
# Input   : PS4 Bluetooth Classic (BR/EDR) + ESP-NOW + WSN-31 UART
#

# Target chip
CONFIG_IDF_TARGET="esp32"

# Serial baud rate untuk flashing/monitor
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
CONFIG_ESPTOOLPY_BAUD=921600

# ESP-NOW
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_TX_BA_WIN=6
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_NVS_ENABLED=y
CONFIG_ESP_WIFI_SOFTAP_BEACON_MAX_LEN=752

# Bluetooth Classic (BR/EDR) for PS4 Controller
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLUEDROID_PINNED_TO_ID_0=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_A2DP_ENABLE=n
CONFIG_BT_SPP_ENABLE=n
CONFIG_BT_HFP_ENABLE=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TICK_RATE_HZ=1000

# Logging
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y

# Main task stack
CONFIG_MAIN_TASK_STACK_SIZE=4096

# Compiler optimizations
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y

# Partition scheme (huge_app — 3MB app, 1MB SPIFFS)
CONFIG_PARTITION_TABLE_CUSTOM=n
CONFIG_PARTITION_TABLE_SINGLE_APP=y
